waves2foam/parameter_study/solitary3DPorous/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-6.285 0 -0.5 )
    (  0 0 -0.5 )
    (-6.285  1 -0.5 )
    (  0 1  -0.5 )

    (-6.285 0  0.5025 )
    (  0 0  0.5025 )
    (-6.285  1  0.5025 )
    (  0  1  0.5025 )
);

blocks          
(
    hex (0 1 3 2 4 5 7 6) ( 200 25 50 ) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet
    (
        (0 4 6 2)
    )
    patch bottom 
    (
        (0 1 3 2)
    )
    patch outlet
    (
        (1 5 7 3)
    )

    patch atmosphere 
    (
        (4 5 7 6)
    )
    
    patch back
    (
        (0 1 5 4)
    )

    patch front
    (
        (2 3 7 6)
    )

    patch wall
    (
  
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
