waves2foam/parameter_study/solitary3DPorous/0.org/p_rgh.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Revision: 1740                                  |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type gabcPressureRobinV;
        value uniform 0;
        fixedCoeffs uniform 0;
        gradCoeffs  uniform 1;
        source      uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
    outlet
    {
        type gabcPressureRobinV;
        value uniform 0;
        fixedCoeffs uniform 0;
        gradCoeffs  uniform 1;
        source      uniform 0;
    }
    atmosphere
    {
        type            totalPressure;
        phi             phi;
        rho             rho;
        p0              uniform 0;
    }

    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
